Autodesk.Revit.UI.ViewSheetSetUIData.Create(System.String,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Create a new view sheet set in auto sort mode
name:
View sheet set name to be created.
sheetSchemaId:
Sheet schema id to be sorted with.
viewSchemaId:
View schema id to be sorted with.
viewIds:
View id(s) to be saved with.
Returns:
ElementId is invalid if creates failed
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.UI.ViewSheetSetUIData.Create(System.String,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Create a new view sheet set in manual sort mode
name:
View sheet set name to be created.
viewIds:
View id(s) with order to be created with.
Returns:
ElementId is invalid if creates failed
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.UI.ViewSheetSetUIData.Save(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Save the changes for the current view sheet set in auto sort mode
elementId:
The view sheet set to be saved.
sheetSchemaId:
Sheet schema id to be sorted with.
viewSchemaId:
View schema id to be sorted with.
viewIds:
View id(s) to be saved with.
Returns:
False if Save operation fails, otherwise True.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.UI.ViewSheetSetUIData.Save(Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Save the changes for the current view sheet set in manual sort mode
elementId:
The view sheet set to be saved.
viewIds:
View id(s) with order to be saved with.
Returns:
False if Save operation fails, otherwise True.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.UI.ViewSheetSetUIData.Rename(Autodesk.Revit.DB.ElementId,System.String)
Rename the current view sheet set.
elementId:
The view sheet set to be renamed.
newName:
View sheet set name to be renamed as.
Returns:
False if Rename operation fails, otherwise True.
Throws Autodesk.Revit.Exceptions.ArgumentException:
newName is an empty string or contains only whitespace.
-or-
newName cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.UI.ViewSheetSetUIData.Delete(Autodesk.Revit.DB.ElementId)
Delete the view sheet set
elementId:
The view sheet set to be deleted.
Returns:
False if Delete operation fails, otherwise True.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.UI.ViewSheetSetUIData.UseCurrentElement
Call NamedElemData::useCurrentElement for ViewSheetSet

Autodesk.Revit.UI.ViewSheetSetUIData.SetDefaultViewSheetSetId(Autodesk.Revit.DB.ElementId)
Sets the id of default view sheet set.
elementId:
The default view sheet set id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.UI.ViewSheetSetUIData.GetDefaultViewSheetSetId
Gets the id of default view sheet set.
If default is in-session, the id is -1
Returns:
The default view sheet set id.

Autodesk.Revit.UI.ViewSheetSetUIData.SetInSessionAutoSortSchemas(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Sets the set of in-session to auto sort mode with schemas' id.
sheetSchemaId:
Sheet schema id to be sorted with.
viewSchemaId:
View schema id to be sorted with.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.UI.ViewSheetSetUIData.GetInSessionViewSchemaId
Gets the id of in-session set's view schema.
Returns:
View schema id.

Autodesk.Revit.UI.ViewSheetSetUIData.GetInSessionSheetSchemaId
Gets the id of in-session set's sheet schema.
Returns:
Sheet schema id.

Autodesk.Revit.UI.ViewSheetSetUIData.SetInSessionViewIds(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Sets the set of in-session's views' id.
elementIds:
The in-session view id set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.UI.ViewSheetSetUIData.GetInSessionViewIds
Update and get the set of in-session views's id.
Returns:
The in-session view Id set.

Autodesk.Revit.UI.ViewSheetSetUIData.SetInSessionIsAutoSortMode(System.Boolean)
Set in session set's  sort mode
isAutoSort:
True if in auto sort mode

Autodesk.Revit.UI.ViewSheetSetUIData.GetInSessionIsAutoSortMode
Gets if in session set is in auto sort mode
Returns:
True if in auto sort mode

Autodesk.Revit.UI.ViewSheetSetUIData.SetParentHwnd(System.IntPtr)
Sets the parent hwnd

Autodesk.Revit.UI.ViewSheetSetUIData.GetParentHwnd
Gets the parent hwnd
Returns:
The hwnd of parent window

Autodesk.Revit.UI.ViewSheetSetUIData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.ViewSheetSetUIData
UI data wrapper for ViewSheetSetData.